In [61]:
pip install pandas

Requirement already satisfied: pandas in c:\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: numpy>=1.13.3 in c:\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [62]:
import numpy as np
import pandas as pd

# Load data from excel into Pandas

In [93]:
import pandas
df = pandas.read_csv('Pandas - Q1 Sales.csv')
df

      Country Region Sales Person    Date of Purchase     Total  Quantity
0       India  North         John   1/23/2014 0:00:00    100000       567
1          US  North         Bill   10/9/2017 0:00:00    120000      3000
2          UK  North       Thomas   5/17/2010 0:00:00    140000       345
3   Australia   East         John   1/11/2015 0:00:00    160000      1000
4      Africa   East         Bill   7/21/2011 0:00:00    180000       123
5   Singapore   East       Thomas   6/10/2015 0:00:00    200000      1000
6     Mylasia   West         John   5/14/2012 0:00:00   1000000      7890
7       India   West         Bill   6/23/2014 0:00:00    240000       200
8          US   West       Thomas   2/17/2016 0:00:00  26000000      1000
9          UK  North         John  11/11/2015 0:00:00    100000      1000
10  Australia  North         Bill  11/24/2015 0:00:00    120000       567
11     Africa  North       Thomas    9/2/2011 0:00:00    140000      1000
12  Singapore   East         John   5/28/2016 0:00:00    160000       892
13    Mylasia   East         Bill    9/2/2012 0:00:00    180000       444
14      India   East       Thomas   5/15/2013 0:00:00    200000        90
15         US   West         John  12/28/2014 0:00:00    220000        90
16         UK   West         Bill   5/10/2018 0:00:00    240000        90
17  Australia   West       Thomas  10/21/2012 0:00:00    260000        90
18     Africa  North         John   7/13/2010 0:00:00    140000        85
19  Singapore  North         Bill    9/5/2012 0:00:00    150000        85

In [94]:
df.head()

     Country Region Sales Person   Date of Purchase   Total  Quantity
0      India  North         John  1/23/2014 0:00:00  100000       567
1         US  North         Bill  10/9/2017 0:00:00  120000      3000
2         UK  North       Thomas  5/17/2010 0:00:00  140000       345
3  Australia   East         John  1/11/2015 0:00:00  160000      1000
4     Africa   East         Bill  7/21/2011 0:00:00  180000       123

In [8]:
# Load data from np.array
a1= pd.Series(np.random.randint(10, size = 5))
a1

0    3
1    4
2    9
3    9
4    5
dtype: int32

In [9]:
type(a1)

pandas.core.series.Series

In [10]:
a2= pd.Series(np.random.randint(10, size = 5), index =['a','b', 'c', 'd', 'e'])
a2

a    1
b    0
c    6
d    7
e    6
dtype: int32

In [12]:
a2['a'] # thao tác giống Dictionary

1

In [13]:
a3= pd.Series({'a': 21, 'b': 22, 'c': 23, 'd': 24, 'e': 34})
a3

a    21
b    22
c    23
d    24
e    34
dtype: int64

In [25]:
a4= pd.Series(3, index=[0,1,2,3,4,5])
a4

0    3
1    3
2    3
3    3
4    3
5    3
dtype: int64

In [26]:
a3['b':'c']

b    22
c    23
dtype: int64

In [27]:
s = ['India',
'US',
'UK',
'Australia',
'Africa',
'Singapore',
'Mylaysia',
'Thailand',
'Vietnam',
'Laos']
s5 = pd.Series(np.random.randint(10, size = 10), index=s)
s5

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32

In [29]:
s5['UK':'Vietnam']

UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
dtype: int32

In [30]:
s5.median() #giá trị trung bình

3.0

In [34]:
a1 = s5[s5 > 3] #lấy các giá trị lớn hơn 3
print(a1)

print('-----------------------------------------------')
a2 = s5[(s5 % 2) == 0] #lấy các giá trị lớn hơn 3
print(a2)

US           4
UK           7
Singapore    9
Laos         4
dtype: int32
-----------------------------------------------
India       2
US          4
Africa      0
Mylaysia    0
Thailand    0
Laos        4
dtype: int32

In [45]:
print(s5)
print('----------------------------')
t = s5 > s5.median()
t

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32
----------------------------

India        False
US            True
UK            True
Australia    False
Africa       False
Singapore     True
Mylaysia     False
Thailand     False
Vietnam      False
Laos          True
dtype: bool

In [36]:
a3 = s5[s5 > s5.median()]
a3

US           4
UK           7
Singapore    9
Laos         4
dtype: int32

In [43]:
print(s5)
print('------------------')
s5.head(3)

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32
------------------

India    2
US       4
UK       7
dtype: int32

In [44]:
print(s5)
print('-------- index là 1 số âm --------')
s5.head(-3)

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32
-------- index là 1 số âm --------

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
dtype: int32

In [47]:
print(s5)

print('-------------s5.tail(3) --------')
print(s5.tail(3))

print('-------------s5.tail(-3) --------')
print(s5.tail(-3))

India        2
US           4
UK           7
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32
-------------s5.tail(3) --------
Thailand    0
Vietnam     3
Laos        4
dtype: int32
-------------s5.tail(-3) --------
Australia    3
Africa       0
Singapore    9
Mylaysia     0
Thailand     0
Vietnam      3
Laos         4
dtype: int32

# Broadcasting

In [49]:
sd = pd.Series({'mon':21,'tue':31,'wed':42,'thu':12,'fri':52,'sat':45,'sun':14})
sd

mon    21
tue    31
wed    42
thu    12
fri    52
sat    45
sun    14
dtype: int64

In [50]:
sd1 = sd[:'fri']
sd1

mon    21
tue    31
wed    42
thu    12
fri    52
dtype: int64

In [51]:
sd2 = sd['wed':]
sd2

wed    42
thu    12
fri    52
sat    45
sun    14
dtype: int64

In [52]:
sd1 * sd2

fri    2704.0
mon       NaN
sat       NaN
sun       NaN
thu     144.0
tue       NaN
wed    1764.0
dtype: float64

In [55]:
print(sd)
print('----------sd[(sd < 25) | (sd > 50)]-----------')
sd[(sd < 25) | (sd > 50)]

mon    21
tue    31
wed    42
thu    12
fri    52
sat    45
sun    14
dtype: int64
----------sd[(sd < 25) | (sd > 50)]-----------

mon    21
thu    12
fri    52
sun    14
dtype: int64

In [74]:
sd = pd.Series({'mon':21,'tue':31,'wed':42,'thu':12,'fri':52,'sat':45,'sun':75})
print(sd)
print('----------sd[((sd > 25) & (sd < 50)) | (sd > 70)]-----------')
sd[((sd > 25) & (sd < 50)) | (sd > 70)]

mon    21
tue    31
wed    42
thu    12
fri    52
sat    45
sun    75
dtype: int64
----------sd[((sd > 25) & (sd < 50)) | (sd > 70)]-----------

tue    31
wed    42
sat    45
sun    75
dtype: int64

In [75]:
sd = pd.Series({'mon':21,'tue':31,'wed':42,'thu':12,'fri':52,'sat':45,'sun':75})
print(sd)
print('----------sd[((sd > 25) & (sd < 50)) | (sd > 70)]-----------')
sd[(sd > 25) & ((sd < 50) | (sd > 70))]

mon    21
tue    31
wed    42
thu    12
fri    52
sat    45
sun    75
dtype: int64
----------sd[((sd > 25) & (sd < 50)) | (sd > 70)]-----------

tue    31
wed    42
sat    45
sun    75
dtype: int64

In [76]:
sd3 = sd1 * sd2
sd3

fri    2704.0
mon       NaN
sat       NaN
sun       NaN
thu     144.0
tue       NaN
wed    1764.0
dtype: float64

In [80]:
sd3.fillna(0.1)# fill các NAN bằng giá trị 0.1

fri    2704.0
mon       0.1
sat       0.1
sun       0.1
thu     144.0
tue       0.1
wed    1764.0
dtype: float64

In [81]:
sd3.ffill()# fill các NAN bằng giá trị đứng trước nó

fri    2704.0
mon    2704.0
sat    2704.0
sun    2704.0
thu     144.0
tue     144.0
wed    1764.0
dtype: float64

In [99]:
sd3.dropna() # delete các NAN

fri    2704.0
thu     144.0
wed    1764.0
dtype: float64

In [102]:
n = 15
s6 = pd.Series(np.random.randint(20, size = n))
s6

0     13
1     17
2      5
3     15
4      3
5      3
6     13
7     10
8      9
9      3
10     8
11    11
12     6
13     1
14     6
dtype: int32

In [103]:
s6.quantile(.3)

5.2

In [108]:
d = {'one':pd.Series([1., 2., 3.], index=['a','b','c']),
'two':pd.Series([1., 2., 3., 4.], index=['a','b','c','d'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [109]:
df['one'] # lấy theo colum

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [107]:
d2 = [{1, 2., 'Hello'}, {2, 3., 'World'}]
df2 = pd.DataFrame(d2)
df2

   0    1      2
0  1  2.0  Hello
1  2  3.0  World

In [110]:
df3 = pd.DataFrame(d2, columns = ['A', 'B', 'C'])
df3

   A    B      C
0  1  2.0  Hello
1  2  3.0  World

In [112]:
d3 = [{'a': 1, 'b':2}, {'a': 5, 'b':10, 'c': 20}]
df4 = pd.DataFrame(d3, index = ['r_1', 'r_2'])
df5 = pd.DataFrame(d3, columns = ['a', 'b']) 
print(df4)
print('---------------------')
print(df5)

     a   b     c
r_1  1   2   NaN
r_2  5  10  20.0
---------------------
   a   b
0  1   2
1  5  10

In [113]:
df4.shape

(2, 3)

In [114]:
df4.index

Index(['r_1', 'r_2'], dtype='object')

In [115]:
df4.columns

Index(['a', 'b', 'c'], dtype='object')

In [146]:
df = pandas.read_csv('iris.data')
df

     sepal_length  sepal_width  petal_length  petal_width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [139]:
df[df['class'] =='Iris-setosa' ]

    sepal_length   sepal_width   petal_length   petal_width        class
0            5.1           3.5            1.4           0.2  Iris-setosa
1            4.9           3.0            1.4           0.2  Iris-setosa
2            4.7           3.2            1.3           0.2  Iris-setosa
3            4.6           3.1            1.5           0.2  Iris-setosa
4            5.0           3.6            1.4           0.2  Iris-setosa
5            5.4           3.9            1.7           0.4  Iris-setosa
6            4.6           3.4            1.4           0.3  Iris-setosa
7            5.0           3.4            1.5           0.2  Iris-setosa
8            4.4           2.9            1.4           0.2  Iris-setosa
9            4.9           3.1            1.5           0.1  Iris-setosa
10           5.4           3.7            1.5           0.2  Iris-setosa
11           4.8           3.4            1.6           0.2  Iris-setosa
12           4.8           3.0            1.4           0.1  Iris-setosa
13           4.3           3.0            1.1           0.1  Iris-setosa
14           5.8           4.0            1.2           0.2  Iris-setosa
15           5.7           4.4            1.5           0.4  Iris-setosa
16           5.4           3.9            1.3           0.4  Iris-setosa
17           5.1           3.5            1.4           0.3  Iris-setosa
18           5.7           3.8            1.7           0.3  Iris-setosa
19           5.1           3.8            1.5           0.3  Iris-setosa
20           5.4           3.4            1.7           0.2  Iris-setosa
21           5.1           3.7            1.5           0.4  Iris-setosa
22           4.6           3.6            1.0           0.2  Iris-setosa
23           5.1           3.3            1.7           0.5  Iris-setosa
24           4.8           3.4            1.9           0.2  Iris-setosa
25           5.0           3.0            1.6           0.2  Iris-setosa
26           5.0           3.4            1.6           0.4  Iris-setosa
27           5.2           3.5            1.5           0.2  Iris-setosa
28           5.2           3.4            1.4           0.2  Iris-setosa
29           4.7           3.2            1.6           0.2  Iris-setosa
30           4.8           3.1            1.6           0.2  Iris-setosa
31           5.4           3.4            1.5           0.4  Iris-setosa
32           5.2           4.1            1.5           0.1  Iris-setosa
33           5.5           4.2            1.4           0.2  Iris-setosa
34           4.9           3.1            1.5           0.1  Iris-setosa
35           5.0           3.2            1.2           0.2  Iris-setosa
36           5.5           3.5            1.3           0.2  Iris-setosa
37           4.9           3.1            1.5           0.1  Iris-setosa
38           4.4           3.0            1.3           0.2  Iris-setosa
39           5.1           3.4            1.5           0.2  Iris-setosa
40           5.0           3.5            1.3           0.3  Iris-setosa
41           4.5           2.3            1.3           0.3  Iris-setosa
42           4.4           3.2            1.3           0.2  Iris-setosa
43           5.0           3.5            1.6           0.6  Iris-setosa
44           5.1           3.8            1.9           0.4  Iris-setosa
45           4.8           3.0            1.4           0.3  Iris-setosa
46           5.1           3.8            1.6           0.2  Iris-setosa
47           4.6           3.2            1.4           0.2  Iris-setosa
48           5.3           3.7            1.5           0.2  Iris-setosa
49           5.0           3.3            1.4           0.2  Iris-setosa

In [134]:
df[df['class'] = 2 if df['class'] =='Iris-setosa' ]

SyntaxError: invalid syntax (<ipython-input-134-a93f9038fdff>, line 1)

In [147]:
df['petal_length']

0      1.4
1      1.4
2      1.3
3      1.5
4      1.4
      ...
145    5.2
146    5.0
147    5.2
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64

In [148]:
#add new column to the end
df['added'] = df['sepal_length'] - df['petal_length']
df

,sepal_length,sepal_width,petal_length,petal_width,class,added
0,5.1,3.5,1.4,0.2,Iris-setosa,3.7
1,4.9,3.0,1.4,0.2,Iris-setosa,3.5
2,4.7,3.2,1.3,0.2,Iris-setosa,3.4
3,4.6,3.1,1.5,0.2,Iris-setosa,3.1
4,5.0,3.6,1.4,0.2,Iris-setosa,3.6
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,1.5
146,6.3,2.5,5.0,1.9,Iris-virginica,1.3
147,6.5,3.0,5.2,2.0,Iris-virginica,1.3
148,6.2,3.4,5.4,2.3,Iris-virginica,0.8
149,5.9,3.0,5.1,1.8,Iris-virginica,0.8

In [142]:
df.head() # đọc 5 dòng đầu

   sepal_length   sepal_width   petal_length   petal_width        class
0           5.1           3.5            1.4           0.2  Iris-setosa
1           4.9           3.0            1.4           0.2  Iris-setosa
2           4.7           3.2            1.3           0.2  Iris-setosa
3           4.6           3.1            1.5           0.2  Iris-setosa
4           5.0           3.6            1.4           0.2  Iris-setosa

# sqlite3

In [127]:
import sqlite3
conn = sqlite3.connect("20200331_data_log.s3db")

df = pd.read_sql_query("select * from data_log;", conn)
df

,id,LineId,DateTime,Shift,FGs,SKU,Target_speed,Actual_speed,Target_counter,Actual_counter,...,Actual_counterIN,Spare01,Spare02,Spare03,Spare04,Spare05,createId,updateId,created,updated
0,1,1,2020/03/31 06:00:30,1,67717651,1,360@360@6@1@,0@0@0@0@,146880@146880@979@979@,13344@14928@352@0@,...,10176@15108@352@96@,16@16@16@16@,None,None,None,None,None,None,None,None
1,2,1,2020/03/31 06:01:00,1,67717651,1,360@360@6@1@,0@0@0@0@,146880@146880@979@979@,13344@14928@352@0@,...,10176@15108@352@96@,16@16@16@16@,None,None,None,None,None,None,None,None
2,3,1,2020/03/31 06:01:30,1,67717651,1,360@360@6@1@,0@0@0@0@,146880@146880@979@979@,13344@14928@352@0@,...,10176@15108@352@96@,16@16@16@16@,None,None,None,None,None,None,None,None
3,4,1,2020/03/31 06:02:00,1,67717651,1,360@360@6@1@,0@0@0@0@,146880@146880@979@979@,13344@14928@352@0@,...,10176@15108@352@96@,16@16@16@16@,None,None,None,None,None,None,None,None
4,5,1,2020/03/31 06:02:30,1,67717651,1,360@360@6@1@,0@0@0@0@,146880@146880@979@979@,13344@14928@352@0@,...,10176@15108@352@96@,16@16@16@16@,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2872,2873,1,2020/03/31 05:57:30,3,67717651,1,360@360@6@1@,0@0@1@0@,152129@152129@1014@1014@,117426@127338@1873@252@,...,46212@127812@1875@813@,48@48@202@0@,None,None,None,None,None,None,None,None
2873,2874,1,2020/03/31 05:58:00,3,67717651,1,360@360@6@1@,0@0@0@0@,152129@152129@1014@1014@,117426@127338@1873@252@,...,46212@127812@1875@815@,48@48@202@0@,None,None,None,None,None,None,None,None
2874,2875,1,2020/03/31 05:58:30,3,67717651,1,360@360@6@1@,0@0@0@0@,152129@152129@1014@1014@,117426@127338@1873@252@,...,46212@127812@1875@815@,48@48@202@0@,None,None,None,None,None,None,None,None
2875,2876,1,2020/03/31 05:59:00,3,67717651,1,360@360@6@1@,0@0@0@0@,152129@152129@1014@1014@,117426@127338@1873@252@,...,46212@127812@1875@815@,48@48@202@0@,None,None,None,None,None,None,None,None
2876,2877,1,2020/03/31 05:59:30,3,67717651,1,360@360@6@1@,0@0@0@0@,152129@152129@1014@1014@,117426@127338@1873@252@,...,46212@127812@1875@815@,48@48@202@202@,None,None,None,None,None,None,None,None

In [128]:
df['DateTime']

0       2020/03/31 06:00:30
1       2020/03/31 06:01:00
2       2020/03/31 06:01:30
3       2020/03/31 06:02:00
4       2020/03/31 06:02:30
               ...
2872    2020/03/31 05:57:30
2873    2020/03/31 05:58:00
2874    2020/03/31 05:58:30
2875    2020/03/31 05:59:00
2876    2020/03/31 05:59:30
Name: DateTime, Length: 2877, dtype: object

# read_excel

In [122]:
df = pandas.read_excel('PandasTest.xlsx')
df

      Country Region Sales Person Date of Purchase     Total  Quantity
0       India  North         John       2014-01-23    100000       567
1          US  North         Bill       2017-10-09    120000      3000
2          UK  North       Thomas       2010-05-17    140000       345
3   Australia   East         John       2015-01-11    160000      1000
4      Africa   East         Bill       2011-07-21    180000       123
5   Singapore   East       Thomas       2015-06-10    200000      1000
6     Mylasia   West         John       2012-05-14   1000000      7890
7       India   West         Bill       2014-06-23    240000       200
8          US   West       Thomas       2016-02-17  26000000      1000
9          UK  North         John       2015-11-11    100000      1000
10  Australia  North         Bill       2015-11-24    120000       567
11     Africa  North       Thomas       2011-09-02    140000      1000
12  Singapore   East         John       2016-05-28    160000       892
13    Mylasia   East         Bill       2012-09-02    180000       444
14      India   East       Thomas       2013-05-15    200000        90
15         US   West         John       2014-12-28    220000        90
16         UK   West         Bill       2018-05-10    240000        90
17  Australia   West       Thomas       2012-10-21    260000        90
18     Africa  North         John       2010-07-13    140000        85
19  Singapore  North         Bill       2012-09-05    150000        85